-- ===========================================
-- База данных
-- ===========================================

-- Создайте таблицу books.

-- Структура таблицы:

-- id SERIAL PRIMARY KEY
-- title TEXT
-- author TEXT
-- price INT
-- pages INT
-- created_at TIMESTAMP DEFAULT NOW()

-- ===========================================
-- Задание 1
-- ===========================================

-- Создайте таблицу books.

-- OKKKKKK 

CREATE TABLE books (
    id SERIAL PRIMARY KEY,
    title TEXT,
    author TEXT,
    price INT,
    pages INT,
    created_at TIMESTAMP DEFAULT NOW()
);


-- ===========================================
-- Задание 2
-- ===========================================

-- Добавьте 10 книг.

-- У каждой книги должны быть:

-- - название
-- - автор
-- - цена
-- - количество страниц

-- буду заглулить для 10 книг :)

 INSERT INTO books (title, author, price, pages ) VALUES (
       'Евгений Онегин',
        'Александр Сергеевич Пушкин',
        340,
        150
    );

 INSERT INTO books (title, author, price, pages ) VALUES (
        'Горе от ума',
        'Михаила Горько',
        150,
        142
    );
 
 INSERT INTO books (title, author, price, pages ) VALUES (
    'Мастер и Маргарита',
        'Бориса Семеновича Булгакова',
        190,
        300
    );

 INSERT INTO books (title, author, price, pages ) VALUES (
    'Война и мир',
        'Сергея Толстого',
        180,
            300
    );

 INSERT INTO books (title, author, price, pages ) VALUES (
    'Мертвые души',
        'Александра Пушкина',
        150,
        310
    );


-- ===========================================
-- Задание 3
-- ===========================================

-- Выведите все книги.

-- лекго

    SELECT title FROM books;

-- если таблицу.. в место title оставить звездочку "*"

-- ===========================================
-- Задание 4
-- ===========================================

-- Выведите только название и автора всех книг.

    SELECT title, author FROM books;

-- ===========================================
-- Задание 5
-- ===========================================

-- Найдите книгу с id = 5.

    SELECT * FROM books
    WHERE id = 5;

-- ===========================================
-- Задание 6
-- ===========================================

-- Измените цену книги с id = 3.

-- Установите цену 350.

-- OKKK

  UPDATE books 
    SET price = 350 
    WHERE id = 3;

-- ===========================================
-- Задание 7
-- ===========================================

-- Увеличьте цену всех книг на 100.

   UPDATE books
    SET price = 200
    WHERE price < 1000000;

-- не знал с какой функций как всех выводить  
-- (потом условия поставил меньше 1 млн, 
-- для мой таблица всегда true будеть .)

-- ===========================================
-- Задание 8
-- ===========================================

-- Измените количество страниц книги с id = 6.

-- Установите значение 500.

   UPDATE books
    SET pages = 500
    WHERE id = 6;

-- ===========================================
-- Задание 9
-- ===========================================

-- Удалите книгу с id = 8.

    DELETE FROM books
    WHERE id = 8;

-- ===========================================
-- Задание 10
-- ===========================================

-- Удалите все книги, у которых цена меньше 250.

 DELETE FROM books
 WHERE price < 250;
    

-- ===========================================
-- Задание 11
-- ===========================================

-- Выведите книги дороже 400.

    SELECT title FROM books
    WHERE price < 400;

-- ===========================================
-- Задание 12
-- ===========================================

-- Выведите книги, у которых страниц больше 300.

    SELECT title FROM books
    WHERE pages > 300;

-- ===========================================
-- Задание 13
-- ===========================================

-- Отсортируйте книги по цене
-- от большей к меньшей.

    SELECT * FROM books ORDER BY price DESC;

-- ===========================================
-- Задание 14
-- ===========================================

-- Выведите первые 5 книг.

-- ну лимит используем

 SELECT * FROM books ORDER BY title LIMIT 5;

-- ===========================================
-- Практика на Go
-- ===========================================

-- Используя package database/sql:

-- 1. Подключитесь к PostgreSQL.

-- 2. Добавьте новую книгу через Exec().

-- 3. Измените цену книги через Exec().

-- 4. Удалите книгу по id через Exec().

-- 5. Получите id новой книги
--    через INSERT ... RETURNING id.

-- 6. Выведите все книги в консоль.

-- очень сложно выглядить : ) (щаc 15.10.2026 --> 23:41)
-- завтра лучше буду

-- ===========================================
-- Дополнительное задание
-- ===========================================

-- Создайте программу, которая:

-- 1. Добавляет книгу.
-- 2. Показывает все книги.
-- 3. Изменяет цену одной книги.
-- 4. Удаляет одну книгу.
-- 5. Снова выводит список книг.